{
  "questionsf":[
    "История развития программирования. Поколения языков программирования.",
    "Классификация языков программирования. Области применения языков программирования.",
    "Понятие алгоритма. Виды алгоритмов. Свойства алгоритмов.",
    "Понятие блок-схемы. Сфера применения блок-схем.",
    "Понятие программы. Структура программы. Жизненный цикл программы.",
    "Компиляторы и интерпретаторы. Основные этапы решения задач на компьютере.",
    "Ввод и вывод данных в программировании.",
    "Переменные и константы. Их объявление и представление в памяти компьютера.",
    "Понятие области видимости и контекста выполнения.",
    "Типы данных. Простые типы данных.",
    "Производные типы данных. Структурированные типы данных.",
    "Понятие оператора в программировании. Оператор присваивания.",
    "Операции и выражения. Правила формирования и вычисления выражений.",
    "Понятие условия. Виды условий. Комбинирование различных условий.",
    "Понятие цикла. Виды циклов. Вложенные циклы. Понятие инкремента и декремента.",
    "Понятие рекурсии. Отличие рекурсии от вложенных циклов.",
    "Функции и методы в программировании. Понятие аргумента. Понятие чистой функции.",
    "Понятие потока выполнения программы. Понятие прерываний. Влияние прерываний на поток выполнения.",
    "Понятие итерации. Итеративный процесс в программировании.",
    "Виды ошибок в программировании. Способы отладки."
  ],
  "questionss":[
    "Язык JavaScript, история его возникновения. Особенности языка.",
    "Что может и чего не может JavaScript в браузере. Какие существую варианты обхода этих ограничений.",
    "Понятие скрипта. Написание и исполнение скриптов на JavaScript.",
    "Ввод и вывод в JavaScript. Варианты ввода и вывода доступных без использования библиотек расширений.",
    "Переменные и константы в JavaScript, способы их задать. Область видимости переменных в JavaScript.",
    "Типы данных в JavaScript. Особенности приведения типов в JavaScript.",
    "Особые типы данных в JavaScript: null, undefined и NaN.",
    "Массивы и объекты JavaScript, ключевые различия этих структур.",
    "Операции и выражения в JavaScript. Арифметические, логические и операции сравнения.",
    "Условия в JavaScript, их виды и способы их задать.",
    "Циклы в JavaScript, их виды и способы их задать.",
    "Функции в JavaScript, способы их задать и вызвать.",
    "Особенности потока выполнения программы на языке JavaScript и порядок ее выполнения.",
    "Дата и время в JavaScript. Особенности реализации встроенных функций даты и времени в JavaScript.",
    "Обработка ошибок в JavaScript. Способы отладки кода на JavaScript на примере браузера Google Chrome."
  ]
}
